# GetTransactionFinalizer Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailureHandlingOptions..::..GetTransactionFinalizer Method
FailureHandlingOptions Class See Also
---
Gets the callback to be executed after transaction is completed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ITransactionFinalizer GetTransactionFinalizer()
```

Visual Basic
---
```text
Public Function GetTransactionFinalizer As ITransactionFinalizer
```

Visual C++
---
```text
public:
ITransactionFinalizer^ GetTransactionFinalizer()
```

# ### Return Value
The callback to be executed after transaction is completed.
# See Also
FailureHandlingOptions Class
Autodesk.Revit.DB Namespace